Управление_гостиницами_EDT/src/InformationRegisters/ЦеныУслуг/ЦеныУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныУслуг</name>
  <comment>Цены на услуги проживания и дополнительные услуги</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>DefinedType.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_гостиницами_EDT/src/CommonModules/УстановкаЦенСервер/Module.bsl
Функция ПолучитьЦену(Номер,Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныУслугСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныУслуг.СрезПоследних(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), Услуга = &Номер) КАК ЦеныУслугСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Цена")[0];	
	КонецЕсли; 
		


КонецФункции // ПолучитьЦену()

Функция ПериодыЦеныНомера(Номер,НачДата,КонДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныУслуг.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЦеныУслуг КАК ЦеныУслуг
		|ГДЕ
		|	ЦеныУслуг.Услуга = &Номер
		|	И ЦеныУслуг.Период МЕЖДУ &НачДата И &КонДата";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("НачДата", КонецДня(НачДата));
	Запрос.УстановитьПараметр("КонДата", НачалоДня(КонДата));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Период");
	КонецЕсли;

КонецФункции // ПериодыЦеныНомера()
